tutorials/capillaryRiseAxi/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            symmetry;
    }

    bottom
    {
        type            zeroGradient;
    }

    right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            zeroGradient;
    }

    front
    {
        type           wedge;
    }

    back
    {
        type           wedge;
    }
}


// ************************************************************************* //
